Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition Constructor (Identifier, Point)
 Creates a new input definition instance with one point.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Identifier viewId,
	Point point
)
Public Sub New (
	viewId As Identifier,
	point As Point
)
Parameters
viewId
Type: Tekla.Structures.Identifier
The identifier for the view object.
point
Type: Tekla.Structures.Geometry3d.Point
The point.
See Also
Reference
DrawingPluginBase.InputDefinition Class
DrawingPluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace